apps/web/artillery/load-test.yml
config:
  # Target the local development server
  target: "http://localhost:3333"

  # Test phases define how virtual users are created over time
  phases:
    # Warm up phase - 5 users/sec for 30 seconds
    - duration: 30
      arrivalRate: 5
      name: "Warm up"

    # Ramp up - increase from 5 to 20 users/sec over 1 minute
    - duration: 60
      arrivalRate: 5
      rampTo: 20
      name: "Ramp up"

    # Sustained load - 20 users/sec for 2 minutes
    - duration: 120
      arrivalRate: 20
      name: "Sustained load"

    # Cool down - decrease from 20 to 5 users/sec
    - duration: 30
      arrivalRate: 20
      rampTo: 5
      name: "Cool down"

  # Default values
  defaults:
    headers:
      Content-Type: "application/json"
      Accept: "application/json"

  # Variables for test scenarios
  variables:
    searchTerms:
      - "phone"
      - "laptop"
      - "car"
      - "apartment"
      - "bike"
      - "furniture"
    sortOptions:
      - "price-low"
      - "price-high"
      - "newest"
      - "oldest"

  # Ensure we don't overload the server
  ensure:
    maxErrorRate: 5  # Fail if error rate > 5%
    p99: 2000        # 99th percentile response time < 2s

# Test scenarios
scenarios:
  # =============================================
  # HOMEPAGE & BROWSING FLOW (60% of traffic)
  # =============================================
  - name: "Browse Homepage"
    weight: 6
    flow:
      # Visit homepage
      - get:
          url: "/en"
          capture:
            - json: "$.data"
              as: "pageData"

      # Load categories
      - get:
          url: "/api/categories"
          expect:
            - statusCode: 200
            - contentType: "application/json"

      # Load featured ads
      - get:
          url: "/api/ads?limit=12&sortBy=newest"
          expect:
            - statusCode: 200

  # =============================================
  # SEARCH FLOW (20% of traffic)
  # =============================================
  - name: "Search Ads"
    weight: 2
    flow:
      # Search for random term
      - get:
          url: "/api/ads?search={{ searchTerms }}&limit=20"
          expect:
            - statusCode: 200

      # Apply sort filter
      - get:
          url: "/api/ads?search={{ searchTerms }}&sortBy={{ sortOptions }}&limit=20"
          expect:
            - statusCode: 200

      # Paginate results
      - get:
          url: "/api/ads?search={{ searchTerms }}&limit=20&offset=20"
          expect:
            - statusCode: 200

  # =============================================
  # AD DETAIL VIEW (15% of traffic)
  # =============================================
  - name: "View Ad Details"
    weight: 1.5
    flow:
      # Get list of ads first
      - get:
          url: "/api/ads?limit=5"
          capture:
            - json: "$.data[0].id"
              as: "adId"
            - json: "$.data[0].slug"
              as: "adSlug"
          expect:
            - statusCode: 200

      # View ad detail by ID
      - get:
          url: "/api/ads/{{ adId }}"
          ifTrue: "adId"
          expect:
            - statusCode: 200

      # Simulate viewing ad page
      - get:
          url: "/en/ad/{{ adSlug }}"
          ifTrue: "adSlug"

  # =============================================
  # CATEGORY BROWSING (5% of traffic)
  # =============================================
  - name: "Browse Categories"
    weight: 0.5
    flow:
      # Get all categories
      - get:
          url: "/api/categories"
          capture:
            - json: "$.data[0].id"
              as: "categoryId"
          expect:
            - statusCode: 200

      # Get subcategories
      - get:
          url: "/api/categories?includeSubcategories=true"
          expect:
            - statusCode: 200

      # Filter ads by category
      - get:
          url: "/api/ads?category={{ categoryId }}&limit=20"
          ifTrue: "categoryId"
          expect:
            - statusCode: 200